
{{alias}}( p, d1, d2 )
    Evaluates the quantile function for an F distribution with numerator degrees
    of freedom `d1` and denominator degrees of freedom `d2` at a probability
    `p`.

    If `p < 0` or `p > 1`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `d1 <= 0` or `d2 <= 0`, the function returns `NaN`.

    Parameters
    ----------
    p: number
        Input probability.

    d1: number
        Numerator degrees of freedom.

    d2: number
        Denominator degrees of freedom.

    Returns
    -------
    out: number
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.8, 1.0, 1.0 )
    ~9.472
    > y = {{alias}}( 0.5, 4.0, 2.0 )
    ~1.207

    > y = {{alias}}( 1.1, 1.0, 1.0 )
    NaN
    > y = {{alias}}( -0.2, 1.0, 1.0 )
    NaN

    > y = {{alias}}( NaN, 1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.5, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.5, 1.0, NaN )
    NaN

    > y = {{alias}}( 0.5, -1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.5, 1.0, -1.0 )
    NaN


{{alias}}.factory( d1, d2 )
    Returns a function for evaluating the quantile function of an F distribution
    with numerator degrees of freedom `d1` and denominator degrees of freedom
    `d2`.

    Parameters
    ----------
    d1: number
        Numerator degrees of freedom.

    d2: number
        Denominator degrees of freedom.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 10.0, 2.0 );
    > var y = myQuantile( 0.2 )
    ~0.527
    > y = myQuantile( 0.8 )
    ~4.382

    See Also
    --------

