
{{alias}}( p, α, β )
    Evaluates the quantile function for a beta prime distribution with first
    shape parameter `α` and second shape parameter `β` at a probability `p`.

    If `p < 0` or `p > 1`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If `α <= 0` or `β <= 0`, the function returns `NaN`.

    Parameters
    ----------
    p: number
        Input value (probability).

    α: number
        First shape parameter.

    β: number
        Second shape parameter.

    Returns
    -------
    out: number
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.8, 2.0, 1.0 )
    ~8.472
    > y = {{alias}}( 0.5, 4.0, 2.0 )
    ~2.187
    > y = {{alias}}( 1.1, 1.0, 1.0 )
    NaN
    > y = {{alias}}( -0.2, 1.0, 1.0 )
    NaN

    > y = {{alias}}( NaN, 1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.5, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.5, 1.0, NaN )
    NaN

    > y = {{alias}}( 0.5, -1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.5, 1.0, -1.0 )
    NaN


{{alias}}.factory( α, β )
    Returns a function for evaluating the quantile function of a beta prime
    distribution with first shape parameter `α` and second shape parameter `β`.

    Parameters
    ----------
    α: number
        First shape parameter.

    β: number
        Second shape parameter.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 2.0, 2.0 );
    > y = myQuantile( 0.8 )
    ~2.483
    > y = myQuantile( 0.4 )
    ~0.763

    See Also
    --------

