
{{alias}}( x, k )
    Evaluates the probability density function (PDF) for a chi distribution with
    degrees of freedom `k` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `k < 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    k: number
        Degrees of freedom.

    Returns
    -------
    out: number
        Evaluated PDF.

    Examples
    --------
    > var y = {{alias}}( 0.3, 4.0 )
    ~0.013
    > y = {{alias}}( 0.7, 0.7 )
    ~0.537
    > y = {{alias}}( -1.0, 0.5 )
    0.0
    > y = {{alias}}( 0.0, NaN )
    NaN
    > y = {{alias}}( NaN, 2.0 )
    NaN

    // Negative degrees of freedom:
    > y = {{alias}}( 2.0, -1.0 )
    NaN

    // Degenerate distribution when `k = 0`:
    > y = {{alias}}( 2.0, 0.0, 2.0 )
    0.0
    > y = {{alias}}( 0.0, 0.0, 2.0 )
    Infinity


{{alias}}.factory( k )
    Returns a function for evaluating the probability density function (PDF) of
    a chi distribution with degrees of freedom `k`.

    Parameters
    ----------
    k: number
        Degrees of freedom.

    Returns
    -------
    pdf: Function
        Probability density function (PDF).

    Examples
    --------
    > var myPDF = {{alias}}.factory( 6.0 );
    > var y = myPDF( 3.0 )
    ~0.337

    See Also
    --------

