
{{alias}}( x, sigma )
    Evaluates the probability density function (PDF) for a Rayleigh
    distribution with scale parameter `sigma` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a negative value for `sigma`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    sigma: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated PDF.

    Examples
    --------
    > var y = {{alias}}( 0.3, 1.0 )
    ~0.287
    > y = {{alias}}( 2.0, 0.8 )
    ~0.137
    > y = {{alias}}( -1.0, 0.5 )
    0.0
    > y = {{alias}}( 0.0, NaN )
    NaN
    > y = {{alias}}( NaN, 2.0 )
    NaN

    // Negative scale parameter:
    > y = {{alias}}( 2.0, -1.0 )
    NaN

    // Degenerate distribution when `sigma = 0.0`:
    > y = {{alias}}( -2.0, 0.0 )
    0.0
    > y = {{alias}}( 0.0, 0.0 )
    Infinity
    > y = {{alias}}( 2.0, 0.0 )
    0.0


{{alias}}.factory( sigma )
    Returns a function for evaluating the probability density function (PDF) of
    a Rayleigh distribution with scale parameter `sigma`.

    Parameters
    ----------
    sigma: number
        Scale parameter.

    Returns
    -------
    pdf: Function
        Probability density function (PDF).

    Examples
    --------
    > var myPDF = {{alias}}.factory( 4.0 );
    > var y = myPDF( 6.0 )
    ~0.122
    > y = myPDF( 4.0 )
    ~0.152

    See Also
    --------

