
{{alias}}( x, k )
    Evaluates the cumulative distribution function (CDF) for a chi distribution
    with degrees of freedom `k` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `k < 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    k: number
        Degrees of freedom.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 3.0 )
    ~0.739
    > y = {{alias}}( 1.0, 0.5 )
    ~0.846
    > y = {{alias}}( -1.0, 4.0 )
    0.0
    > y = {{alias}}( NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN

    // Negative degrees of freedom:
    > y = {{alias}}( 2.0, -1.0 )
    NaN

    // Degenerate distribution when `k = 0`:
    > y = {{alias}}( 2.0, 0.0 )
    1.0
    > y = {{alias}}( -2.0, 0.0 )
    0.0
    > y = {{alias}}( 0.0, 0.0 )
    0.0

{{alias}}.factory( k )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a chi distribution with degrees of freedom `k`.

    Parameters
    ----------
    k: number
        Degrees of freedom.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var mycdf = {{alias}}.factory( 1.0 );
    > var y = mycdf( 2.0 )
    ~0.954
    > y = mycdf( 1.2 )
    ~0.77

    See Also
    --------

