
{{alias}}( s )
    Evaluates the Riemann zeta function as a function of a real variable `s`.

    Parameters
    ----------
    s: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 1.1 )
    ~10.584
    > y = {{alias}}( -4.0 )
    0.0
    > y = {{alias}}( 70.0 )
    1.0
    > y = {{alias}}( 0.5 )
    ~-1.46
    > y = {{alias}}( NaN )
    NaN

    // Evaluate at a pole:
    > y = {{alias}}( 1.0 )
    NaN

    See Also
    --------

