
{{alias}}( x )
    Computes `gamma(x+1) - 1` without cancellation errors, where `gamma(x)` is
    the gamma function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 0.2 )
    ~-0.082
    > y = {{alias}}( -6.7 )
    ~-0.991
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

