
{{alias}}( k, r, p )
    Evaluates the quantile function for a negative binomial distribution with
    number of successes until experiment is stopped `r` and success probability
    `p` at a probability `k`.

    If provided a `k` outside of `[0,1]`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a `r` which is not a positive number, the function returns
    `NaN`.

    If provided a success probability `p` outside of `[0,1]`, the function
    returns `NaN`.

    Parameters
    ----------
    k: number
        Input probability.

    r: number
        Number of successes until experiment is stopped.

    p: number
        Success probability.

    Returns
    -------
    out: number
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.9, 20.0, 0.2 )
    106
    > y = {{alias}}( 0.9, 20.0, 0.8 )
    8
    > y = {{alias}}( 0.5, 10.0, 0.4 )
    14
    > y = {{alias}}( 0.0, 10.0, 0.9 )
    0

    > y = {{alias}}( 1.1, 20.0, 0.5 )
    NaN
    > y = {{alias}}( -0.1, 20.0, 0.5 )
    NaN

    > y = {{alias}}( 21.0, 15.5, 0.5 )
    12
    > y = {{alias}}( 5.0, 7.4, 0.4 )
    10

    > y = {{alias}}( 0.5, 0.0, 0.5 )
    NaN
    > y = {{alias}}( 0.5, -2.0, 0.5 )
    NaN
    > y = {{alias}}( 0.3, 20.0, -1.0 )
    NaN
    > y = {{alias}}( 0.3, 20.0, 1.5 )
    NaN

    > y = {{alias}}( NaN, 20.0, 0.5 )
    NaN
    > y = {{alias}}( 0.3, NaN, 0.5 )
    NaN
    > y = {{alias}}( 0.3, 20.0, NaN )
    NaN


{{alias}}.factory( r, p )
    Returns a function for evaluating the quantile function of a negative
    binomial distribution with number of successes until experiment is stopped
    `r` and success probability `p`.

    Parameters
    ----------
    r: number
        Number of successes until experiment is stopped.

    p: number
        Success probability.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 10.0, 0.5 );
    > var y = myQuantile( 0.1 )
    5
    > y = myQuantile( 0.9 )
    16

    See Also
    --------

