
{{alias}}( x, μ )
    Evaluates the moment-generating function (MGF) for a degenerate distribution
    with mean `μ`.

    If provided `NaN` for any argument, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    μ: number
        Constant value of distribution.

    Returns
    -------
    out: number
        Evaluated MGF.

    Examples
    --------
    > var y = {{alias}}( 1.0, 1.0 )
    ~2.718
    > y = {{alias}}( 2.0, 3.0 )
    ~403.429
    > y = {{alias}}( NaN, 0.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN


{{alias}}.factory( μ )
    Returns a function for evaluating the moment-generating function (MGF) of a
    degenerate distribution with mean `μ`.

    Parameters
    ----------
    μ: number
        Constant value of distribution.

    Returns
    -------
    mgf: Function
        Moment-generating function (MGF).

    Examples
    --------
    > var myMGF = {{alias}}.factory( 10.0 );
    > var y = myMGF( 0.1 )
    ~2.718

    See Also
    --------

