
{{alias}}( x, r, p )
    Evaluates the cumulative distribution function (CDF) for a negative binomial
    distribution with number of successes until experiment is stopped `r` and
    success probability `p` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a `r` which is not a positive number, the function returns
    `NaN`.

    If provided a success probability `p` outside of `[0,1]`, the function
    returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    r: number
        Number of successes until experiment is stopped.

    p: number
        Success probability.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 5.0, 20.0, 0.8 )
    ~0.617
    > y = {{alias}}( 21.0, 20.0, 0.5 )
    ~0.622
    > y = {{alias}}( 5.0, 10.0, 0.4 )
    ~0.034
    > y = {{alias}}( 0.0, 10.0, 0.9 )
    ~0.349
    > y = {{alias}}( 21.0, 15.5, 0.5 )
    ~0.859
    > y = {{alias}}( 5.0, 7.4, 0.4 )
    ~0.131

    > y = {{alias}}( 2.0, 0.0, 0.5 )
    NaN
    > y = {{alias}}( 2.0, -2.0, 0.5 )
    NaN

    > y = {{alias}}( NaN, 20.0, 0.5 )
    NaN
    > y = {{alias}}( 0.0, NaN, 0.5 )
    NaN
    > y = {{alias}}( 0.0, 20.0, NaN )
    NaN

    > y = {{alias}}( 2.0, 20, -1.0 )
    NaN
    > y = {{alias}}( 2.0, 20, 1.5 )
    NaN


{{alias}}.factory( r, p )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a negative binomial distribution with number of successes until
    experiment is stopped `r` and success probability `p`.

    Parameters
    ----------
    r: number
        Number of successes until experiment is stopped.

    p: number
        Success probability.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 10, 0.5 );
    > var y = myCDF( 3.0 )
    ~0.046
    > y = myCDF( 11.0 )
    ~0.668

    See Also
    --------

