
{{alias}}( p, x0, Ɣ )
    Evaluates the quantile function for a Cauchy distribution with location
    parameter `x0`  and scale parameter `Ɣ` at a probability `p`.

    If `p < 0` or `p > 1`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `Ɣ <= 0`, the function returns `NaN`.

    Parameters
    ----------
    p: number
        Input probability.

    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.3, 2.0, 2.0 )
    ~0.547
    > y = {{alias}}( 0.8, 10, 2.0 )
    ~12.753
    > y = {{alias}}( 0.1, 10.0, 2.0 )
    ~3.845

    > y = {{alias}}( 1.1, 0.0, 1.0 )
    NaN
    > y = {{alias}}( -0.2, 0.0, 1.0 )
    NaN

    > y = {{alias}}( NaN, 0.0, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 0.0, NaN )
    NaN

    // Negative scale parameter:
    > y = {{alias}}( 0.5, 0.0, -1.0 )
    NaN


{{alias}}.factory( x0, Ɣ )
    Returns a function for evaluating the quantile function of a Cauchy
    distribution with location parameter `x0` and scale parameter `Ɣ`.

    Parameters
    ----------
    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 10.0, 2.0 );
    > var y = myQuantile( 0.5 )
    10.0

    See Also
    --------

