
{{alias}}( x )
    Evaluates the natural exponential function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    ~54.5982
    > y = {{alias}}( -9.0 )
    ~1.234e-4
    > y = {{alias}}( 0.0 )
    1.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

