
{{alias}}( x )
    Computes `exp(x)-1`, where `exp(x)` is the natural exponential function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 0.2 )
    ~0.221
    > y = {{alias}}( -9.0 )
    ~-1.0
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

