
{{alias}}( x, x0, Ɣ )
    Evaluates the cumulative distribution function (CDF) for a Cauchy
    distribution with location parameter `x0` and scale parameter `Ɣ` at a value
    `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `Ɣ <= 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 4.0, 0.0, 2.0 )
    ~0.852
    > y = {{alias}}( 1.0, 0.0, 2.0 )
    ~0.648
    > y = {{alias}}( 1.0, 3.0, 2.0 )
    0.25
    > y = {{alias}}( NaN, 0.0, 2.0 )
    NaN
    > y = {{alias}}( 1.0, 2.0, NaN )
    NaN
    > y = {{alias}}( 1.0, NaN, 3.0 )
    NaN


{{alias}}.factory( x0, Ɣ )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a Cauchy distribution with location parameter `x0` and scale parameter
    `Ɣ`.

    Parameters
    ----------
    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 1.5, 3.0 );
    > var y = myCDF( 1.0 )
    ~0.447

    See Also
    --------

