
{{alias}}( x )
    Computes the reciprocal square root of a single-precision floating-point
    number.

    For `x < 0`, the reciprocal square root is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Reciprocal square root.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    0.5
    > y = {{alias}}( 0.0 )
    Infinity
    > y = {{alias}}( Infinity )
    0.0
    > y = {{alias}}( -4.0 )
    NaN
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

