
{{alias}}( x, μ )
    Evaluates the cumulative distribution function (CDF) for a degenerate
    distribution with mean value `μ`.

    If provided `NaN` for any argument, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    μ: number
        Constant value of distribution.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 3.0 )
    0.0
    > y = {{alias}}( 4.0, 3.0 )
    1.0
    > y = {{alias}}( 3.0, 3.0 )
    1.0
    > y = {{alias}}( NaN, 0.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN


{{alias}}.factory( μ )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a degenerate distribution centered at a provided mean value.

    Parameters
    ----------
    μ: number
        Constant value of distribution.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 5.0 );
    > var y = myCDF( 3.0 )
    0.0
    > y = myCDF( 6.0 )
    1.0

    See Also
    --------

