
{{alias}}( p, sigma )
    Evaluates the quantile function for a Rayleigh distribution with scale
    parameter `sigma` at a probability `p`.

    If `p < 0` or `p > 1`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a negative probability for `sigma`, the function returns `NaN`.

    Parameters
    ----------
    p: number
        Input probability.

    sigma: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.8, 1.0 )
    ~1.794
    > y = {{alias}}( 0.5, 4.0 )
    ~4.71

    > y = {{alias}}( 1.1, 1.0 )
    NaN
    > y = {{alias}}( -0.2, 1.0 )
    NaN

    > y = {{alias}}( NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN

    // Negative scale parameter:
    > y = {{alias}}( 0.5, -1.0 )
    NaN


{{alias}}.factory( sigma )
    Returns a function for evaluating the quantile function of a Rayleigh
    distribution with scale parameter `sigma`.

    Parameters
    ----------
    sigma: number
        Scale parameter.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 0.4 );
    > var y = myQuantile( 0.4 )
    ~0.404
    > y = myQuantile( 1.0 )
    Infinity

    See Also
    --------

