
{{alias}}( x )
    Computes the cube root of a double-precision floating-point number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Cube root.

    Examples
    --------
    > var y = {{alias}}( 64.0 )
    4.0
    > y = {{alias}}( 27.0 )
    3.0
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( -0.0 )
    -0.0
    > y = {{alias}}( -9.0 )
    ~-2.08
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

