
{{alias}}( x )
    Evaluates the factorial of `x`.

    If provided `NaN`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Factorial.

    Examples
    --------
    > var y = {{alias}}( 3.0 )
    6.0
    > y = {{alias}}( -1.5 )
    ~-3.545
    > y = {{alias}}( -0.5 )
    ~1.772
    > y = {{alias}}( 0.5 )
    ~0.886
    > y = {{alias}}( -10.0 )
    NaN
    > y = {{alias}}( 171.0 )
    Infinity
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

