
{{alias}}( x, α, β )
    Evaluates the natural logarithm of the cumulative distribution function
    (CDF) for a beta distribution with first shape parameter `α` and second
    shape parameter `β` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If `α <= 0` or `β <= 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    α: number
        First shape parameter.

    β: number
        Second shape parameter.

    Returns
    -------
    out: number
        Evaluated logCDF.

    Examples
    --------
    > var y = {{alias}}( 0.5, 1.0, 1.0 )
    ~-0.693
    > y = {{alias}}( 0.5, 2.0, 4.0 )
    ~-0.208
    > y = {{alias}}( 0.2, 2.0, 2.0 )
    ~-2.263
    > y = {{alias}}( 0.8, 4.0, 4.0 )
    ~-0.034
    > y = {{alias}}( -0.5, 4.0, 2.0 )
    -Infinity
    > y = {{alias}}( 1.5, 4.0, 2.0 )
    0.0

    > y = {{alias}}( 2.0, -1.0, 0.5 )
    NaN
    > y = {{alias}}( 2.0, 0.5, -1.0 )
    NaN

    > y = {{alias}}( NaN, 1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 1.0, NaN )
    NaN


{{alias}}.factory( α, β )
    Returns a function for evaluating the natural logarithm of the cumulative
    distribution function (CDF) of a beta distribution with first shape
    parameter `α` and second shape parameter `β`.

    Parameters
    ----------
    α: number
        First shape parameter.

    β: number
        Second shape parameter.

    Returns
    -------
    logcdf: Function
        Logarithm of cumulative distribution function (CDF).

    Examples
    --------
    > var mylogcdf = {{alias}}.factory( 0.5, 0.5 );
    > var y = mylogcdf( 0.8 )
    ~-0.35
    > y = mylogcdf( 0.3 )
    ~-0.997

    See Also
    --------

