
{{alias}}( x, sigma )
    Evaluates the cumulative distribution function (CDF) for a Rayleigh
    distribution with scale parameter `sigma` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a negative value for `sigma`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    sigma: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 3.0 )
    ~0.199
    > y = {{alias}}( 1.0, 2.0 )
    ~0.118
    > y = {{alias}}( -1.0, 4.0 )
    0.0
    > y = {{alias}}( NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN

    // Negative scale parameter:
    > y = {{alias}}( 2.0, -1.0 )
    NaN

    // Degenerate distribution when `sigma = 0.0`:
    > y = {{alias}}( -2.0, 0.0 )
    0.0
    > y = {{alias}}( 0.0, 0.0 )
    1.0
    > y = {{alias}}( 2.0, 0.0 )
    1.0


{{alias}}.factory( sigma )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a Rayleigh distribution with scale parameter `sigma`.

    Parameters
    ----------
    sigma: number
        Scale parameter.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 0.5 );
    > var y = myCDF( 1.0 )
    ~0.865
    > y = myCDF( 0.5 )
    ~0.393

    See Also
    --------

