
{{alias}}( x )
    Computes the principal square root of a single-precision floating-point
    number.

    For `x < 0`, the principal square root is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Principal square root.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    2.0
    > y = {{alias}}( 9.0 )
    3.0
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( -4.0 )
    NaN
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

