
{{alias}}( x, sigma )
    Evaluates the logarithm of the cumulative distribution function (CDF) for a
    Rayleigh distribution with scale parameter `sigma` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a negative value for `sigma`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    sigma: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated logCDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 3.0 )
    ~-1.613
    > y = {{alias}}( 1.0, 2.0 )
    ~-2.141
    > y = {{alias}}( -1.0, 4.0 )
    -Infinity
    > y = {{alias}}( NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN )
    NaN
    // Negative scale parameter:
    > y = {{alias}}( 2.0, -1.0 )
    NaN


{{alias}}.factory( sigma )
    Returns a function for evaluating the logarithm of the cumulative
    distribution function (CDF) of a Rayleigh distribution with scale parameter
    `sigma`.

    Parameters
    ----------
    sigma: number
        Scale parameter.

    Returns
    -------
    logcdf: Function
        Logarithm of cumulative distribution function (CDF).

    Examples
    --------
    > var mylogcdf = {{alias}}.factory( 0.5 );
    > var y = mylogcdf( 1.0 )
    ~-0.145
    > y = mylogcdf( 0.5 )
    ~-0.933

    See Also
    --------

