
{{alias}}( x )
    Evaluates the standard logistic function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    0.5
    > y = {{alias}}( 1.0 )
    ~0.731
    > y = {{alias}}( -1.0 )
    ~0.269
    > y = {{alias}}( Infinity )
    1.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------
